library-core/wsdl/ehealth-iam-sts-saml1-v1_X509.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol" xmlns:soap11="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:sts="urn:be:fgov:ehealth:sts:protocol:v1" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="Saml11TokenService" targetNamespace="urn:be:fgov:ehealth:sts:protocol:v1">

  <documentation>SAML 1.1 Token Service: Version 1.2</documentation>

  <wsp:Policy xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="X509">
    <sp:AsymmetricBinding>
        <wsp:Policy>
            <sp:InitiatorToken>
                <wsp:Policy>
                    <sp:X509Token sp:IncludeToken="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702/IncludeToken/AlwaysToRecipient">
                        <wsp:Policy>
                            <sp:WssX509V3Token10/>
                        </wsp:Policy>
                    </sp:X509Token>
                </wsp:Policy>
            </sp:InitiatorToken>
            <sp:RecipientToken>
                <wsp:Policy>
                    <sp:X509Token sp:IncludeToken="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702/IncludeToken/Never">
                        <wsp:Policy>
                            <sp:WssX509V3Token10/>
                        </wsp:Policy>
                    </sp:X509Token>
                </wsp:Policy>
            </sp:RecipientToken>
            <sp:AlgorithmSuite>
                <wsp:Policy>
                    <sp:Basic256/>
                </wsp:Policy>
            </sp:AlgorithmSuite>
            <sp:Layout>
                <wsp:Policy>
                    <sp:Lax/>
                </wsp:Policy>
            </sp:Layout>
            <sp:IncludeTimestamp/>
            <sp:ProtectTokens/>
            <sp:OnlySignEntireHeadersAndBody/>
        </wsp:Policy>
    </sp:AsymmetricBinding>
    <sp:Wss10>
        <wsp:Policy>
            <sp:MustSupportRefKeyIdentifier/>
            <sp:MustSupportRefIssuerSerial/>
        </wsp:Policy>
    </sp:Wss10>
    <sp:SignedParts>
        <sp:Body/>
    </sp:SignedParts>
</wsp:Policy>
  <types>
    <xsd:schema>
      <xsd:import namespace="urn:oasis:names:tc:SAML:1.0:protocol" schemaLocation="oasis-sstc-saml-schema-protocol-1.1.xsd"/>
    </xsd:schema>
  </types>

  <message name="RequestMessage">
    <part element="samlp:Request" name="body"/>
  </message>
  <message name="ResponseMessage">
    <part element="samlp:Response" name="body"/>
  </message>

  <portType name="Saml11TokenServicePortType">
    <operation name="RequestSecurityToken">
      <input message="sts:RequestMessage"/>
      <output message="sts:ResponseMessage"/>
    </operation>
  </portType>

  <binding name="Saml11TokenServiceSOAPBinding" type="sts:Saml11TokenServicePortType">
    <soap11:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="RequestSecurityToken">
      <soap11:operation soapAction="urn:be:fgov:ehealth:sts:protocol:v1:RequestSecurityToken"/>
      <input>
        <wsp:PolicyReference xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" URI="#X509"/>
        <soap11:body use="literal"/>
      </input>
      <output>
        <soap11:body use="literal"/>
      </output>
    </operation>
  </binding>

  <service name="Saml11TokenService">
    <port binding="sts:Saml11TokenServiceSOAPBinding" name="Saml11TokenServiceSOAP11">
      <soap11:address location="https://services.ehealth.fgov.be/IAM/Saml11TokenService/v1"/>
    </port>
  </service>

</definitions>
