data/idp/blackbox/aa/request02.txt

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"><Body>
    <Request IssueInstant="2005-03-01T15:58:17Z" MajorVersion="1" MinorVersion="1" RequestID="d206a5ba1d50c3afd855dea0b0106cb6" xmlns="urn:oasis:names:tc:SAML:1.0:protocol" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol">
        <AttributeQuery Resource="urn:x-shibtest:SP">
            <Subject xmlns="urn:oasis:names:tc:SAML:1.0:assertion">
                <NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified" NameQualifier="urn:x-shibtest:IdP">test-handle</NameIdentifier>
                <SubjectConfirmation>
                    <ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:bearer</ConfirmationMethod>
                </SubjectConfirmation>
            </Subject>
        </AttributeQuery>
    </Request>
</Body></Envelope>
