packages/pybktools/pybktools-0.0.1.tar.gz/pybktools-0.0.1/pybktools/tmpl/MOA-ID-AUTH-GetAuthenticationData-REQUEST.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<samlp:Request IssueInstant="2008-07-14T17:51:40+02:00" MajorVersion="1" 
               MinorVersion="0" RequestID="28258239ef97ed87" 
               xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol">
<samlp:AssertionArtifact>TOBEFILLED</samlp:AssertionArtifact>
</samlp:Request>
</soapenv:Body>
</soapenv:Envelope>
