www/assets/requests/saml_assertion_request.xml

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP:Body>
    <samlp:Request xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol" MajorVersion="1" MinorVersion="1" IssueInstant="2010-05-03T06:53:51Z" RequestID="aa23159489-0126-1853-28ca-d7024556c36">
      <samlp:AuthenticationQuery>
        <saml:Subject xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion">
          <saml:NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">root</saml:NameIdentifier>
        </saml:Subject>
      </samlp:AuthenticationQuery>
    </samlp:Request>
  </SOAP:Body>
</SOAP:Envelope>